backend: tensorflow
class_name: Sequential
config:
- class_name: Bidirectional
  config:
    batch_input_shape: !!python/tuple
    - null
    - 30
    - 6
    dtype: float32
    layer:
      class_name: LSTM
      config:
        activation: tanh
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        dropout: 0.0
        go_backwards: false
        implementation: 1
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config:
            distribution: uniform
            mode: fan_avg
            scale: 1.0
            seed: null
        kernel_regularizer: null
        name: lstm_6
        recurrent_activation: hard_sigmoid
        recurrent_constraint: null
        recurrent_dropout: 0.0
        recurrent_initializer:
          class_name: Orthogonal
          config:
            gain: 1.0
            seed: null
        recurrent_regularizer: null
        return_sequences: false
        return_state: false
        stateful: false
        trainable: true
        unit_forget_bias: true
        units: 125
        unroll: false
        use_bias: true
    merge_mode: concat
    name: bidirectional_6
    trainable: true
- class_name: Dropout
  config:
    name: dropout_6
    noise_shape: null
    rate: 0.5
    seed: null
    trainable: true
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config:
        distribution: uniform
        mode: fan_avg
        scale: 1.0
        seed: null
    kernel_regularizer: null
    name: dense_11
    trainable: true
    units: 125
    use_bias: true
- class_name: Dense
  config:
    activation: softmax
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config:
        distribution: uniform
        mode: fan_avg
        scale: 1.0
        seed: null
    kernel_regularizer: null
    name: dense_12
    trainable: true
    units: 4
    use_bias: true
keras_version: 2.1.5
